# nc: 80  # number of classes
# Parameters
nc: 1 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# LeYOLO Large backbone
backbone:
 # [from, repeats, module, args]
  # - [-1, 1, conv_bn_hswish, [16, 2]]  # 0-P1/2
  # - [-1, 1, MobileNetV3_InvertedResidual, [16, 16, 3, 1, 1, 0]]  

  # - [-1, 1, MobileNetV3_InvertedResidual, [24, 64, 3, 2, 0, 0]]  # 2-p2/4
  # - [-1, 1, MobileNetV3_InvertedResidual, [24, 72, 3, 1, 0, 0]]
 
  # - [-1, 1, MobileNetV3_InvertedResidual, [40, 72, 5, 2, 1, 0]]  # 4-p3/8
  # - [-1, 1, MobileNetV3_InvertedResidual, [40, 120, 5, 1, 1, 0]]
  # - [-1, 1, MobileNetV3_InvertedResidual, [40, 120, 5, 1, 1, 0]]

  # - [-1, 1, MobileNetV3_InvertedResidual, [80, 240, 3, 2, 0, 1]] # 7-p4/16
  # - [-1, 1, MobileNetV3_InvertedResidual, [80, 200, 3, 1, 0, 1]]
  # - [-1, 1, MobileNetV3_InvertedResidual, [80, 184, 3, 1, 0, 1]]
  # - [-1, 1, MobileNetV3_InvertedResidual, [80, 184, 3, 1, 0, 1]]
  # - [-1, 1, MobileNetV3_InvertedResidual, [112, 480, 3, 1, 1, 1]] 
  # - [-1, 1, MobileNetV3_InvertedResidual, [112, 672, 3, 1, 1, 1]]
  # - [-1, 1, MobileNetV3_InvertedResidual, [160, 672, 5, 1, 1, 1]]  

  # - [-1, 1, MobileNetV3_InvertedResidual, [160, 960, 5, 2, 1, 1]] # 14-p5/32
  # - [-1, 1, MobileNetV3_InvertedResidual, [160, 960, 5, 1, 1, 1]]
  # - [-1, 1, SPPFCSPC, [160, 5]]     # SPPF  16   

  # mobilenetv3-small
  - [-1, 1, conv_bn_hswish, [16, 2]]  # 0-P1/2
 
  - [-1, 1, MobileNetV3_InvertedResidual, [16, 16, 3, 2, 1, 0]]  # 1-p2/4
 
  - [-1, 1, MobileNetV3_InvertedResidual, [24, 72, 3, 2, 0, 0]]  # 2-p3/8
  - [-1, 1, MobileNetV3_InvertedResidual, [24, 88, 3, 1, 0, 0]]
 
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 96, 5, 2, 1, 1]]  # 4-p4/16
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 120, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 144, 5, 1, 1, 1]]
 
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 288, 5, 2, 1, 1]]  # 9-p5/32
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]
  - [-1, 1, SPPFCSPC, [96, 5]]     # SPPF  12                     
  
# LeYOLO Large head
head:
  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  # - [[-1, 13], 1, Concat, [1]]  # cat backbone P4  18
  # - [-1, 3, C2f, [256]]  # 19

  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  # - [[-1, 6], 1, Concat, [1]]  # cat backbone P3  
  # - [-1, 3, C2f, [128]]  # 22 (P3/8-small)

  # - [-1, 1, Conv, [128, 3, 2]]
  # - [[-1, 19], 1, Concat, [1]]  # cat head P4
  # - [-1, 3, C2f, [256]]  # 25 (P4/16-medium)

  # - [-1, 1, Conv, [256, 3, 2]]
  # - [[-1, 16], 1, Concat, [1]]  # cat head P5
  # - [-1, 3, C2f, [512]]  # 28 (P5/32-large)

  # - [[22, 25, 28], 1, Pose, [nc, kpt_shape]]  # pose(P3, P4, P5)


  # mobilev3-small
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4  14
  - [-1, 3, C2f, [256]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [128]]  # 18 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [256]]  # 21 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [512]]  # 24 (P5/32-large)

  - [[18, 21, 24], 1, Pose, [nc, kpt_shape]]  # pose(P3, P4, P5)

  # mobilev3-small
  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  # - [[-1, 8], 1, Concat, [1]]  # cat backbone P4  14
  # - [-1, 3, C2f, [256]]  # 15

  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  # - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  # - [-1, 3, C2f, [128]]  # 18 (P3/8-small)

  # - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  # - [[-1, 1], 1, Concat, [1]]  # cat backbone P2
  # - [-1, 3, C2f, [64]]  # 21 (P3/8-small)

  # - [-1, 1, Conv, [64, 3, 2]]
  # - [[-1, 18], 1, Concat, [1]]  # cat head P3
  # - [-1, 3, C2f, [128]]  # 24 (P4/16-medium)

  # - [-1, 1, Conv, [128, 3, 2]]
  # - [[-1, 15], 1, Concat, [1]]  # cat head P4
  # - [-1, 3, C2f, [256]]  # 27 (P5/32-large)

  # - [-1, 1, Conv, [256, 3, 2]]
  # - [[-1, 12], 1, Concat, [1]]  # cat head P5
  # - [-1, 3, C2f, [512]]  # 30 (P5/32-large)

  # - [[21, 24, 27, 30], 1, Pose, [nc, kpt_shape]]  # pose(P2, P3, P4, P5)

